## Library Import

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

### Reading NEPSE DATAFRAME

In [2]:
df = pd.read_csv("/home/nxxer/Project Learn/Source/NEPSE/NEPSE.csv")

In [3]:
df.head()

   S.no  Symbol            Date   Open   High    Low  Close     Vol
0     0  ACEDBL  2012-01-01.csv  114.0  113.0  112.0  113.0   1,962
1     1  ACEDPO  2012-01-01.csv  188.0  114.0  114.0  114.0  10,000
2     2    ADBL  2012-01-01.csv  115.0  115.0  113.0  114.0   1,111
3     3    AHPC  2012-01-01.csv  319.0  319.0  312.0  312.0     377
4     4   ALDBL  2012-01-01.csv  102.0  101.0  101.0  101.0      30

### Selecting NABIL Bank Row

In [4]:
df1 = df.loc[df['Symbol'] == 'NABIL']

In [5]:
df1.head()

     S.no Symbol            Date   Open   High    Low  Close    Vol
44     44  NABIL  2012-01-01.csv  873.0  879.0  851.0  879.0    799
115    37  NABIL  2012-01-02.csv  879.0  913.0  882.0  900.0  1,002
192    41  NABIL  2012-01-03.csv  900.0  916.0  892.0  892.0  2,653
271    41  NABIL  2012-01-04.csv  892.0  875.0  842.0  865.0    490
338    33  NABIL  2012-01-05.csv  865.0  875.0  858.0  858.0    121

### Removing .csv from date

In [6]:
df1['Date'] = df['Date'].str.replace('.csv', '')

/tmp/ipykernel_16111/323440152.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df1['Date'] = df['Date'].str.replace('.csv', '')
/tmp/ipykernel_16111/323440152.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Date'] = df['Date'].str.replace('.csv', '')

In [7]:
df1.head()

     S.no Symbol        Date   Open   High    Low  Close    Vol
44     44  NABIL  2012-01-01  873.0  879.0  851.0  879.0    799
115    37  NABIL  2012-01-02  879.0  913.0  882.0  900.0  1,002
192    41  NABIL  2012-01-03  900.0  916.0  892.0  892.0  2,653
271    41  NABIL  2012-01-04  892.0  875.0  842.0  865.0    490
338    33  NABIL  2012-01-05  865.0  875.0  858.0  858.0    121

In [8]:
unwanted=['S.no','Symbol']
df1 = df1.drop(unwanted, axis = 1,)

In [9]:
df1.head()

           Date   Open   High    Low  Close    Vol
44   2012-01-01  873.0  879.0  851.0  879.0    799
115  2012-01-02  879.0  913.0  882.0  900.0  1,002
192  2012-01-03  900.0  916.0  892.0  892.0  2,653
271  2012-01-04  892.0  875.0  842.0  865.0    490
338  2012-01-05  865.0  875.0  858.0  858.0    121

In [10]:
df1.shape

(1910, 6)

In [13]:
df1.describe()

              Open         High          Low        Close
count  1910.000000  1910.000000  1910.000000  1910.000000
mean   1538.958115  1555.184817  1522.249215  1539.656021
std     559.777683   568.388348   554.175755   561.606581
min     662.000000   669.000000   660.000000   667.000000
25%     955.000000   960.000000   944.000000   952.250000
50%    1570.000000  1585.000000  1550.000000  1572.000000
75%    1940.000000  1960.000000  1916.000000  1941.500000
max    2720.000000  2800.000000  2700.000000  2750.000000

### Checking Null Values

In [14]:
df1.isnull().sum()

Date     0
Open     0
High     0
Low      0
Close    0
Vol      0
dtype: int64